[
  {
    "id": "9e375d67-38b9-4f53-9f53-259449d9a5a7",
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/81q77Q39nEL._SY385_.jpg",
    "coverColor": "#97171c",
    "description": "Harry Potter, an orphaned boy, discovers on his eleventh birthday that he is a wizard and is destined to attend Hogwarts School of Witchcraft and Wizardry. He learns about his parents' deaths and the evil wizard who caused them.",
    "totalCopies": 1000,
    "availableCopies": 995,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "Harry Potter's life is turned upside down when he learns he is a wizard. He receives an invitation to Hogwarts, where he makes friends, learns magic, and uncovers the truth about his past and the dark wizard who killed his parents."
  },
  {
    "id": "d308889d-7bb4-4b8e-97b5-3e59d3d182e8",
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/51NUYJDvkgL._SY445_SX342_.jpg",
    "coverColor": "#036640",
    "description": "Harry returns to Hogwarts for his second year and finds the school under attack from a mysterious force that is petrifying students. He and his friends investigate the source of these attacks, leading them to a hidden chamber.",
    "totalCopies": 950,
    "availableCopies": 945,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "Strange events and attacks plague Hogwarts, and Harry must discover the truth behind the legendary Chamber of Secrets. With the help of Ron and Hermione, he unravels the mystery and confronts an old enemy."
  },
  {
    "id": "6d6b0f36-e148-4d83-8e71-b1839987b367",
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/514HX6+75OL._SY445_SX342_.jpg",
    "coverColor": "#d4d4d4",
    "description": "A dangerous prisoner, Sirius Black, escapes from the wizard prison Azkaban and is believed to be after Harry. Hogwarts implements heightened security measures, and Harry learns more about his parents' past.",
    "totalCopies": 900,
    "availableCopies": 895,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "With a supposed threat on his life from the escaped prisoner Sirius Black, Harry's third year at Hogwarts is full of new challenges. He learns about his family's history and encounters magical creatures like hippogriffs."
  },
  {
    "id": "505c5a85-a479-4e3d-860b-465f73f6037f",
    "title": "Harry Potter and the Goblet of Fire",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/81zeKRGCPpL._SY385_.jpg",
    "coverColor": "#040957",
    "description": "Harry is unexpectedly chosen as a competitor in the dangerous Triwizard Tournament. He faces life-threatening tasks and discovers a sinister plot that marks the return of Lord Voldemort.",
    "totalCopies": 850,
    "availableCopies": 845,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "Harry's fourth year is marked by the Triwizard Tournament, a dangerous competition between three wizarding schools. Amidst the challenges, he uncovers a plot that leads to the resurgence of a dark force."
  },
  {
    "id": "7a1a18d4-572a-4d53-963d-b725e7d15698",
    "title": "Harry Potter and the Order of the Phoenix",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/51Z7ZD8xBGL._SY445_SX342_.jpg",
    "coverColor": "#699bc4",
    "description": "After Voldemort's return, Harry and a secret organization called the Order of the Phoenix work to oppose him. At Hogwarts, Harry faces a tyrannical new Defense Against the Dark Arts teacher and increasing visions of Voldemort.",
    "totalCopies": 800,
    "availableCopies": 795,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "In his fifth year, Harry forms a secret group to prepare for the looming threat of Voldemort. He deals with the Ministry of Magic's interference and a new, oppressive teacher at Hogwarts, all while experiencing unsettling visions."
  },
  {
    "id": "4169b68c-f968-4255-b592-d900b919d189",
    "title": "Harry Potter and the Half-Blood Prince",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/71C8Krtzt1L._SY385_.jpg",
    "coverColor": "#45544c",
    "description": "As Voldemort's power grows, Harry learns about the Dark Lord's past and his quest for immortality. Dumbledore and Harry work together to uncover the secret to Voldemort's potential downfall.",
    "totalCopies": 750,
    "availableCopies": 745,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "During his sixth year, Harry delves into the past of Lord Voldemort with Dumbledore's guidance. They seek to understand his weaknesses while the wizarding world faces increasing danger and uncertainty."
  },
  {
    "id": "321a5b7f-3a4d-4d29-8e59-1b11d95d0758",
    "title": "Harry Potter and the Deathly Hallows",
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 5,
    "coverUrl": "https://m.media-amazon.com/images/I/81aCMT1zKtL._SY385_.jpg",
    "coverColor": "#1e1e1e",
    "description": "Harry, Ron, and Hermione embark on a perilous quest to find and destroy Voldemort's Horcruxes, the secret to his immortality. The final battle between good and evil takes place at Hogwarts.",
    "totalCopies": 700,
    "availableCopies": 695,
    "videoUrl": "public/video/harry_potter_and_the_philosopher_stone.mp4",
    "summary": "In the final installment, Harry and his friends undertake a dangerous mission to destroy the Horcruxes and defeat Voldemort once and for all. The quest culminates in an epic battle at Hogwarts, where the fate of the wizarding world is decided."
  }
]